Revit 2024 API
ParameterTypeId.ViewportView Property
 "View"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ViewportView { get; }
Visual Basic
Public Shared ReadOnly Property ViewportView As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ViewportView {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace